app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("name", "email", "role", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @admin =Admin.new(params_admin)
        if @admin.save

UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$11$4PEXb4sSMjctHvD80wBR7O4LBibg/7Ocj7iz5.NbXAzNFWM7viubK"], ["updated_at", "2016-11-24 23:10:53.416099"], ["id", 1]]
---
    def update
      passwd = params[:admin][:password]
      passwd_confirmation = params[:admin][:password_confirmation]

        if passwd.blank? && passwd_confirmation.blank?
          params[:admin].delete(:password)
          params[:admin].delete(:password_confirmation)
        end

        if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]
---
    def destroy
      if @admin.destroy