app/controllers/backoffice/categories_controller.rb

INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Teste"], ["created_at", "2016-11-22 22:45:05.681594"], ["updated_at", "2016-11-22 22:45:05.681594"]]
---
  def create
    @category =CategoryService.create(params_category)

UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "Testes"], ["updated_at", "2016-11-22 23:16:08.124317"], ["id", 11]]
---
  def update
    if @category.update(params_category)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 11]]
---
    def set_category
        @category = Category.friendly.find(params[:id])