app/controllers/site/home_controller.rb

  def index
    @categories = Category.order_by_description
---
SELECT "categories".* FROM "categories"  ORDER BY "categories"."description" ASC